'use strict';

const questions = require("./questions.json")

const sections = require("./sections.json")


/* get section name and number of it's questions
for (let section of sections) {
let tempArr = questions.filter(element => element.section_id == section.id.toString()
);
console.log(section.name + '   -   ' + tempArr.length)
}
*/

// 1. Загальні положення   -   38
// 2. Обов'язки і права водіїв механічних транспортних засобів   -   37
// 3. Рух транспортних засобів із спеціальними сигналами   -   16
// 4. Обов'язки і права пішоходів   -   26
// 5. Обов'язки і права пасажирів   -   16
// 6. Вимоги до велосипедистів   -   22
// 7. Вимоги до осіб, які керують гужовим транспортом, і погоничів тварин   -   8
// 8.1. Регулювання дорожнього руху (Регульовані перехрестя)   -   84
// 8.2. Регулювання дорожнього руху (Нерегульовані перехрестя)   -   7
// 9. Попереджувальні сигнали   -   60
// 10. Початок руху та зміна його напрямку   -   76
// 11. Розташування транспортних засобів на дорозі   -   39
// 12. Швидкість руху   -   41
// 13. Дистанція, інтервал, зустрічний роз'їзд   -   13
// 14. Обгін   -   57
// 15. Зупинка і стоянка   -   97
// 16.1. Проїзд перехресть​ (Регульовані перехрестя)   -   34
// 16.2. Проїзд перехресть​ (Нерегульовані перехрестя)   -   109
// 17. Переваги маршрутних транспортних засобів   -   12
// 18. Проїзд пішохідних переходів і зупинок транспортних засобів   -   19
// 19. Користування зовнішніми світловими приладами   -   33
// 20. Рух через залізничні переїзди   -   31
// 21. Перевезення пасажирів   -   12
// 22. Перевезення вантажу   -   6
// 23. Буксирування та експлуатація транспортних составів   -   20
// 24. Навчальна їзда   -   14
// 25. Рух транспортних засобів у колонах   -   8
// 26. Рух у житловій та пішохідній зоні   -   13
// 27. Рух по автомагістралях і дорогах для автомобілів   -   14
// 28. Рух по гірських дорогах і на крутих спусках   -   8
// 29. Міжнародний рух   -   1
// 30. Номерні, розпізнавальні знаки, написи і позначення   -   14
// 31. Технічний стан транспортних засобів та їх обладнання   -   18
// 32. Окремі питання дорожнього руху, що потребують узгодження   -   5
// 33.1 Попереджувальні знаки   -   82
// 33.2 Знаки пріоритету   -   25
// 33.3 Заборонні знаки   -   92
// 33.4 Наказові знаки   -   32
// 33.5 Інформаційно-вказівні знаки   -   89
// 33.6 Знаки сервісу   -   5
// 33.7 Таблички до дорожніх знаків   -   25
// 34. Дорожня розмітка   -   35
// 35. Основи безпечного водіння   -   170
// 36. Основи права в області дорожнього руху   -   8
// 37. Надання першої медичної допомоги   -   38
// 38. Етика водіння, культура та відпочинок водія   -   14
// 39. Європротокол   -   6
// 44. Додаткові питання щодо категорій В1, В (Загальні)   -   16
// 45. Додаткові питання щодо категорій В1, В (Будова і терміни)   -   33
// 46. Додаткові питання щодо категорій В1, В (Юридична відповідальність)   -   9
// 47. Додаткові питання щодо категорій В1, В (Безпека)   -   7